In [1]:
import pandas as pd 
import matplotlib as plt
import seaborn as sns

In [2]:
df = pd.read_csv('./prices-split-adjusted.csv')
df.tail(5)

,date,symbol,open,close,low,high,volume
851259,2016-12-30,ZBH,103.309998,103.199997,102.849998,103.930000,973800.0
851260,2016-12-30,ZION,43.070000,43.040001,42.689999,43.310001,1938100.0
851261,2016-12-30,ZTS,53.639999,53.529999,53.270000,53.740002,1701200.0
851262,2016-12-30,AIV,44.730000,45.450001,44.410000,45.590000,1380900.0
851263,2016-12-30,FTV,54.200001,53.630001,53.389999,54.480000,705100.0

# Calculate the avag volume:

In [3]:
avg_volume = df.groupby("date",as_index = False).mean()
avg_volume.head(5)
volume = df[["date","volume"]].groupby("date",as_index = False).mean()
volume.head(5)

         date        volume
0  2010-01-04  6.038159e+06
1  2010-01-05  7.490021e+06
2  2010-01-06  7.179431e+06
3  2010-01-07  7.975295e+06
4  2010-01-08  6.573375e+06

# Calculate the max hieght

In [4]:
max_hieght = df[["high"]].max()
max_hieght

high    1600.930054
dtype: float64

In [ ]:
sns.set()
sns.barplot(x='high',y='volume',data=avg_volume)